education_examples = [
    {
        "input": "Образование: 1) Высшее техническое (МГТУ), 2) Среднее педагогическое",
        "output": {
            "edu_list": [
                {
                    "level": "Высшее",
                    "specialization": ["Техническое"]
                },
                {
                    "level": "Среднее-специальное",
                    "specialization": ["Педагогическое"]
                }
            ]
        },
    },
    {
        "input": "Требования: высшее экономическое или юридическое образование",
        "output": {
            "edu_list": [
                {
                    "level": "Высшее",
                    "specialization": ["Экономическое", "Юридическое"]
                }
            ]
        },
    },
    {
        "input": "Кандидат не указал образование",
        "output": {
            "edu_list": [
                {
                    "level": "Не указано",
                    "specialization": ["Не указано"]
                }
            ]
        },
    },
    {
        "input": "Образование: среднее-специальное в области логистики или экономики; высшее предпочтительно",
        "output": {
            "edu_list": [
                {
                    "level": "Среднее-специальное",
                    "specialization": ["Логистическое", "Экономическое"]
                },
                {
                    "level": "Высшее",
                    "specialization": ["Не указано"]
                }
            ]
        },
    },
    {
        "input": "Допускается любое образование",
        "output": {
            "edu_list": [
                {
                    "level": "Не указано",
                    "specialization": ["Другое"]
                }
            ]
        },
    },
]
