"""
Пайплан создания финального отчета для отправки по api
"""

from .pipelines.format_job_description.pydantic_models.flyer_format import FlyerFormat
from .pipelines.format_job_description.pydantic_models.media import MediaFormat
from .pipelines.format_job_description.pydantic_models.social_media import (
    SocialMediaFormat,
)
from .pipelines.job_description.pydantic_models.generation import (
    GeneratedVacancyDescription,
    RequirementSection,
    TaskSection,
)


def get_report(generation_results: dict) -> dict:
    """
    Формирует описания вакансии в различных форматах: для сайта, флаера, ТВ/газеты, соцсетей.

    Parameters:
        generation_results (dict): Словарь с результатами генерации.

    Returns:
        dict: Словарь с ключами job_site, job_flyer_format, job_media_format, job_social_media_format
    """
    report = {}

    # --- Работный сайт ---
    try:
        # Получаем описание вакансии и позицию
        jd = generation_results["job_description"]["structured_job_description"]
        position = jd.get('position').strip()

         # Получаем задачи и требования
        responsibilities = jd.get('responsibilities', {})
        tasks = [responsibilities.get(f"task_{i}") for i in range(1, 6)]
        tasks = [t for t in tasks if t]
    
        requirements_dict = jd.get('requirements', {})
        requirements = [requirements_dict.get(f"requirement_{i}") for i in range(1, 6)]
        requirements = [r for r in requirements if r]
        
        # Собираем описание вакансии
        job_site_template = f"""
        Вакансия: **{position}**
        
        **Мы предлагаем**
        
        - Работу в крупнейшей транспортно-логистической компании в России
        - Официальное оформление, социальный пакет
        - ДМС, включая стоматологию
        - Активную корпоративную жизнь, скидочную систему от партнеров
        - Корпоративное обучение
        - График работы:
        
        **Основные задачи**
        """

        job_site_template += "".join(f"- {task}\n" for task in tasks)
        
        job_site_template += "\n**Мы ожидаем**\n\n"
        job_site_template += "".join(f"- {req}\n" for req in requirements)

        report["job_site"] = job_site_template.strip()
    except Exception as e:
        report["job_site"] = f"Ошибка при формировании описания вакансии: {e}"

    # --- Флаер ---
    try:
        flyer: FlyerFormat = generation_results["job_formats"]["flyer_data"]
        flyer_template = (
            f"{flyer.get('company_info')}\n\n"
            f"**Позиция:** {position} \n\n"
            f"🚀 **О работе:**\n{flyer.get('job_details')}\n\n"
            f"🔍 **О кандидате:**\n{flyer.get('requirements')}\n\n"
            f"💰 **Вознаграждение:**  по результатам собеседования\n\n"
            "Если вы готовы присоединиться к нашей команде и попробовать свои силы в реализации масштабных проектов, пиши в Telegram: @hr_contact"
        )
        report["job_flyer_format"] = flyer_template.strip()
    except Exception as e:
        report["job_flyer_format"] = f"Ошибка при формировании флаера: {e}"

    # --- Газета / ТВ ---
    try:
        media: MediaFormat = generation_results["job_formats"]["media_data"]
        media_template = (
            f"**Вакансия:** {media.get('job_title')}\n\n"
            "**Зарплата:**\n"
            f"**Ключевые задачи:** {media.get('key_function')}\n\n"
            f"**Контакты:** cv@fesco.com"
        )
        report["job_media_format"] = media_template.strip()
    except Exception as e:
        report["job_media_format"] = f"Ошибка при формировании описания для медиа: {e}"

    # --- Социальные сети ---
    try:
        social: SocialMediaFormat = generation_results["job_formats"][
            "social_media_data"
        ]
        social_template = (
            f"🏢 **{social.get('company_info')}**\n\n"
            "📋 **О работе и обязанностях:**\n"
            f"{social.get('project_info')}\n\n"
            f"✅ **Требования:**\n{social.get('key_requirements')}\n\n"
            "💰 **Вознаграждение:**\n📍 **Локация:**\n\n"
            "📞 **Контакты:** cv@fesco.com\n\n" + " ".join(social.get('hashtags', []))
        )
        report["job_social_media_format"] = social_template.strip()
    except Exception as e:
        report["job_social_media_format"] = (
            f"Ошибка при формировании описания для соцсетей: {e}"
        )

    return report


if __name__ == "__main__":
    # Пример входных данных
    mock_input = {
        "job_description": {
            "message": "Успешно",
            "structured_job_description": GeneratedVacancyDescription(
                position="Python-разработчик",
                responsibilities=TaskSection(
                    task_1="Разработка и поддержка веб-приложений на основе Django и FastAPI.",
                    task_2="Участие в проектировании архитектуры программного обеспечения и выбор технологий.",
                    task_3="Оптимизация существующего кода и улучшение производительности приложений.",
                    task_4="Сотрудничество с командой разработчиков для достижения общих целей проекта.",
                    task_5="Анализ требований и участие в планировании задач в рамках Agile-методологии.",
                ),
                requirements=RequirementSection(
                    requirement_1="Необходимы навыки работы с фреймворками Django и FastAPI.",
                    requirement_2="Знание дополнительных технологий, таких как Docker и PostgreSQL, будет преимуществом.",
                    requirement_3="Опыт работы в разработке на Python не менее 3 лет.",
                    requirement_4="Образование высшее в области информатики или смежных дисциплин обязательно.",
                    requirement_5="Требуются навыки командной работы, адаптивности и критического мышления.",
                ),
            ),
        },
        "job_formats": {
            "message": "Успешно",
            "flyer_data": FlyerFormat(
                company_info="FESCO – ведущая транспортно-логистическая компания, предоставляющая комплексные решения в области грузоперевозок и логистики.",
                job_details="Присоединяйтесь к нашей команде в роли Python-разработчика, где вы будете разрабатывать и поддерживать веб-приложения на основе Django и FastAPI, участвовать в проектировании архитектуры программного обеспечения и оптимизировать существующий код для повышения производительности.",
                requirements="Ищем специалиста с опытом разработки на Python не менее 3 лет, навыками работы с фреймворками Django и FastAPI, а также знанием Docker и PostgreSQL. Высшее образование в области информатики обязательно.",
                salary_range="от 150 000 до 250 000 рублей на руки",
            ),
            "media_data": MediaFormat(
                job_title="Python-разработчик",
                salary="null",
                key_function="Разработка и поддержка веб-приложений на основе Django и FastAPI.",
            ),
            "social_media_data": SocialMediaFormat(
                company_info="В крупную транспортно-логистическую компанию требуется Python-разработчик. Компания – лидер в сфере контейнерных перевозок с активами в портах, железнодорожном и интегрированном логистическом бизнесе.",
                project_info="Ваша задача будет заключаться в разработке и поддержке веб-приложений на основе Django и FastAPI. Вы будете участвовать в проектировании архитектуры программного обеспечения, оптимизации существующего кода и сотрудничестве с командой разработчиков для достижения общих целей проекта.",
                key_requirements="Мы ищем кандидата с опытом работы на Python не менее 3 лет, навыками работы с фреймворками Django и FastAPI. Знание Docker и PostgreSQL будет преимуществом. Образование в области информатики или смежных дисциплин обязательно. Также требуются навыки командной работы, адаптивности и критического мышления.",
                hashtags=[
                    "#Python",
                    "#Django",
                    "#FastAPI",
                    "#логистика",
                    "#разработка",
                    "#вакансия",
                ],
            ),
        },
    }

    result = get_report(mock_input)
    print("--- Описание вакансии для работного сайта ---\n")
    print(result["job_social_media_format"])
