soft_skills_examples = [
    {
        "input": """
        Ищем опытного Python разработчика для работы над высоконагруженным проектом.
        Задачи:
        - Разработка и поддержка микросервисной архитектуры
        - Код-ревью и менторинг младших разработчиков
        - Участие в планировании спринтов и архитектурных обсуждениях
        - Взаимодействие с командами аналитиков и тестировщиков
        Требования:
        - Опыт работы с Python от 3 лет
        - Знание Docker, Kubernetes
        - Опыт работы с PostgreSQL
        """,
        "output": 
        {
          "soft_skills": [
            "Умение работать в команде",
            "Наставничество",
            "Критическое мышление"
          ]
        },
    },
    {
        "input": """
        Требуется докер-механизатор.
        Обязанности:
        - Выполнение ПРР грузов различных видов и номенклатуры с судов, автотранспорта, выполнение/контроль такелажных работ; строповка грузов
        - Управление колесной перегрузочной техникой – вилочный погрузчик, фронтальный погрузчик, трактор
        - Выполнение общехозяйственных работ на территории предприятия в составе звена и/или индивидуально
        - Соблюдение требований должностной инструкций, производственной дисциплины, правил внутреннего трудового распорядка и т.п.
        Требования:
        - Опыт работы от 1 года
        - Опыт управления погрузочной, перегрузочной, строительной техникой
        - Ответственность, исполнительность, аккуратность.
        """,
        "output": 
        {
          "soft_skills": [
            "Исполнительность",
            "Ответственность",
            "Аккуратность"
          ]
        },
    },
    {
        "input": """
        Требуется Менеджер по логистике.
        Обязанности:
        - Участие в тендерах
        - Обеспечивать загрузку собственной техники
        - Осуществлять поиск новых заказчиков и развивать клиентскую базу
        - Документальное и информационное сопровождение перевозо
        Требования:
        - Опыт работы от 1 года
        - Знание рабочих документов (накладные, маршрутные листы)
        - Высокий уровень клиентоориентированности и ответственности
        """,
        "output": 
        {
          "soft_skills": [
            "Исполнительность",
            "Целеустремленность",
            "Многозадачность"
          ]
        },
    },
]
